---
kind: property
id: P:Autodesk.Revit.DB.CameraInfo.NearDistance
source: html/74236919-5164-1ddb-b5bd-5b41a4d18dc5.htm
---
# Autodesk.Revit.DB.CameraInfo.NearDistance Property

Distance from eye point to near plane of view frustum along the view direction.

## Syntax (C#)
```csharp
public double NearDistance { get; }
```

## Remarks
This property together with FarDistance determines the depth restrictions of a view frustum.